// операторы

// Если сложить строку и число то получится строка(это конкатенация)
// инкремент++
// декремент--
// Если в начале то префиксная форма.Если в конце то постфиксная.
// Если префиксно поставим, то сначала исполнится++ или--, а потом выведится с новым значением.А если постфиксно, то выведится старое значение, но занесется в переменную уже новое.
// % это остаток деления от двух чисел
// 5 % 2=1
// 5 делиим на 2 = 2. А 1 остаток, поэтому 5 % 2=1
//   = присвоение
//   == равно
//   === строгое равенство.сравниваем по типу данных
//     && когда и то и другое тру(и и)
//       || когда хоть что - то одно тру(или или)
// !не(если хотим применить к ==, то будет так !=, а если к ===, то так !==)