// Переменные и строгий режим

// - = это присвоение
// - имя переменной может состоять их цифр, букв, симфолов $ и _. Первым символом не может быть цифра. Имена переменных не могут повторять зарезирвированные слова языка: error, promt, alert, class, let, return, function
// - имя переменной нужно давать осмысленно, чтобы было понятно что лежит в ней.
// - Регистр имеет значение
// - константа не может изменяться. Хороший тон задавать конст там, где это возможно
// - прямых констант в js не бывает 
// - хоистинг или всплытие переменных. когда мы можем переменную (var)использовать до того, как она объявлена
// - let и const будут не видны за пределами {}. var - будет виден
// - 'usr strict' это знаичт, что мы работает в новом режиме. и некоторые ошибки js старых версий - исправлены