// Классификация типов данных в JavaScript

// Типы данных (8):
// простые типы:
// - Числа
// - string
// - boolean 
// - null (когда этого не существует)
// - undefined (существует, но значения никакого нет)
// - symbol
// - BiGInt (больше чем два в 53 степени минус 1)

// объекты: 
// 1) специальные 2)обычные
// - массивы
// - функции
// - объект даты
// - регулярные выражения
// - ошибки

// Числа
// - Можно получить infinity (бесконечность). это если что-то поделить на 0. Если какой-то минус поделить на 0, то получится -infinity;
// - NaN (not a number/ не число). Если например строку умножить на число.

// Строки
// Они записываются в кавычках
// Косые обратные кавычки (на клавиатуре тильда) называются бэктики

// Объект
// Комплексный вид данных
// Они могут внутри {} содержать любые типы данных
// можно обратиться через точку, чтобы получить значения одного из свойств. Или через кв скобки, но свойство в кавычках должно быть.
// внутри {ключ(свойство): значени}

// массивы
// это частный случай объекта, а не какой-то отдельный тип данных
// могут включать любые типы данных